# Import Library

In [2]:
import pandas as pd

# Dataframe in Pandas

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types

In [3]:
# Import dataset

In [4]:
pwd

'C:\\Users\\aryan\\OneDrive\\Desktop\\PANDAS'

In [5]:
pd.read_excel("Python_Pandas.xlsx")

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,2010-06-27,159.42,2533654.00,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,2012-09-15,117.11,576782.80,248406.36
2,Europe,Russia,Office Supplies,Offline,L,2014-08-05,524.96,1158502.59,224598.75
3,Sub_Saharan Africa,Sao Tome and Principe,Fruits,Online,C,2014-05-07,6.92,75591.66,19525.82
4,Sub_Saharan Africa,Rwanda,Office Supplies,Offline,L,2013-06-02,524.96,3296425.02,639077.50
...,...,...,...,...,...,...,...,...,...
95,Sub_Saharan Africa,Mali,Clothes,Online,M,2011-03-09,35.84,97040.64,65214.72
96,Asia,Malaysia,Fruits,Offline,L,2011-12-28,6.92,58471.11,15103.47
97,Sub_Saharan Africa,Sierra Leone,Vegetables,Offline,C,2016-06-29,90.93,228779.10,93748.05
98,North America,Mexico,Personal Care,Offline,M,2015-08-08,56.67,471336.91,144521.02
99,Sub_Saharan Africa,Mozambique,Household,Offline,L,2012-02-15,502.54,3586605.09,889472.91

In [6]:
cd C:\\Users\\aryan\\OneDrive\\Desktop\\PANDAS

C:\Users\aryan\OneDrive\Desktop\PANDAS

In [7]:
sales=pd.read_excel("Python_Pandas.xlsx")

In [8]:
sales.head(3)

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,2010-06-27,159.42,2533654.00,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,2012-09-15,117.11,576782.80,248406.36
2,Europe,Russia,Office Supplies,Offline,L,2014-08-05,524.96,1158502.59,224598.75

In [9]:
#Names of all columns in dataset
sales.columns

Index(['Region', 'Country', 'Item_Type', 'Sales_Channel', 'Order_Priority',
       'Ship_Date', 'Unit_Cost', 'Total_Revenue', 'Total_Profit'],
      dtype='object')

In [10]:
#First 5 records of data
sales.head()

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,2010-06-27,159.42,2533654.00,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,2012-09-15,117.11,576782.80,248406.36
2,Europe,Russia,Office Supplies,Offline,L,2014-08-05,524.96,1158502.59,224598.75
3,Sub_Saharan Africa,Sao Tome and Principe,Fruits,Online,C,2014-05-07,6.92,75591.66,19525.82
4,Sub_Saharan Africa,Rwanda,Office Supplies,Offline,L,2013-06-02,524.96,3296425.02,639077.50

In [11]:
#Last 5 records of data
sales.tail()

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit
95,Sub_Saharan Africa,Mali,Clothes,Online,M,2011-03-09,35.84,97040.64,65214.72
96,Asia,Malaysia,Fruits,Offline,L,2011-12-28,6.92,58471.11,15103.47
97,Sub_Saharan Africa,Sierra Leone,Vegetables,Offline,C,2016-06-29,90.93,228779.10,93748.05
98,North America,Mexico,Personal Care,Offline,M,2015-08-08,56.67,471336.91,144521.02
99,Sub_Saharan Africa,Mozambique,Household,Offline,L,2012-02-15,502.54,3586605.09,889472.91

In [12]:
#First 3 records of data
sales.head(3)

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,2010-06-27,159.42,2533654.00,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,2012-09-15,117.11,576782.80,248406.36
2,Europe,Russia,Office Supplies,Offline,L,2014-08-05,524.96,1158502.59,224598.75

In [13]:
#Last 3 records of data
sales.tail(3)

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit
97,Sub_Saharan Africa,Sierra Leone,Vegetables,Offline,C,2016-06-29,90.93,228779.10,93748.05
98,North America,Mexico,Personal Care,Offline,M,2015-08-08,56.67,471336.91,144521.02
99,Sub_Saharan Africa,Mozambique,Household,Offline,L,2012-02-15,502.54,3586605.09,889472.91

# Slicing & Dicing

# Data Selection

In [14]:
#select a single column(Selecting data using Labels (Column Headings))
sales['Region'].head()

0                Australia and Oceania
1    Central America and the Caribbean
2                               Europe
3                   Sub_Saharan Africa
4                   Sub_Saharan Africa
Name: Region, dtype: object

In [15]:
sales.Country.head()

0                   Tuvalu
1                  Grenada
2                   Russia
3    Sao Tome and Principe
4                   Rwanda
Name: Country, dtype: object

In [16]:
#Method 2: use the column name as an 'attribute'; gives the same output
sales.Region.head()

0                Australia and Oceania
1    Central America and the Caribbean
2                               Europe
3                   Sub_Saharan Africa
4                   Sub_Saharan Africa
Name: Region, dtype: object

In [17]:
#pass a list of column(select multiple columns)
sales[['Region','Total_Profit']].head()

                              Region  Total_Profit
0              Australia and Oceania     951410.50
1  Central America and the Caribbean     248406.36
2                             Europe     224598.75
3                 Sub_Saharan Africa      19525.82
4                 Sub_Saharan Africa     639077.50

In [18]:
#what if you flip the order
sales[['Total_Profit','Region']].head()

   Total_Profit                             Region
0     951410.50              Australia and Oceania
1     248406.36  Central America and the Caribbean
2     224598.75                             Europe
3      19525.82                 Sub_Saharan Africa
4     639077.50                 Sub_Saharan Africa

In [19]:
sales[['Country','Order_Priority']].head()

                 Country Order_Priority
0                 Tuvalu              H
1                Grenada              C
2                 Russia              L
3  Sao Tome and Principe              C
4                 Rwanda              L

In [20]:
#create an object that only contain Region column
Region_data=sales['Country']
Region_data.head(3)

0     Tuvalu
1    Grenada
2     Russia
Name: Country, dtype: object

In [21]:
#Creating a new column-new
sales['region_country']=sales['Region']+" || C : "+sales['Country']
sales.head()

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit,region_country
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,2010-06-27,159.42,2533654.00,951410.50,Australia and Oceania || C : Tuvalu
1,Central America and the Caribbean,Grenada,Cereal,Online,C,2012-09-15,117.11,576782.80,248406.36,Central America and the Caribbean || C : Grenada
2,Europe,Russia,Office Supplies,Offline,L,2014-08-05,524.96,1158502.59,224598.75,Europe || C : Russia
3,Sub_Saharan Africa,Sao Tome and Principe,Fruits,Online,C,2014-05-07,6.92,75591.66,19525.82,Sub_Saharan Africa || C : Sao Tome and Principe
4,Sub_Saharan Africa,Rwanda,Office Supplies,Offline,L,2013-06-02,524.96,3296425.02,639077.50,Sub_Saharan Africa || C : Rwanda

In [22]:
#Slicing Subsets of Rows in Python
#select first 3 rows
sales[0:3]

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit,region_country
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,2010-06-27,159.42,2533654.00,951410.50,Australia and Oceania || C : Tuvalu
1,Central America and the Caribbean,Grenada,Cereal,Online,C,2012-09-15,117.11,576782.80,248406.36,Central America and the Caribbean || C : Grenada
2,Europe,Russia,Office Supplies,Offline,L,2014-08-05,524.96,1158502.59,224598.75,Europe || C : Russia

In [23]:
#select first 5 rows
sales[:5]

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit,region_country
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,2010-06-27,159.42,2533654.00,951410.50,Australia and Oceania || C : Tuvalu
1,Central America and the Caribbean,Grenada,Cereal,Online,C,2012-09-15,117.11,576782.80,248406.36,Central America and the Caribbean || C : Grenada
2,Europe,Russia,Office Supplies,Offline,L,2014-08-05,524.96,1158502.59,224598.75,Europe || C : Russia
3,Sub_Saharan Africa,Sao Tome and Principe,Fruits,Online,C,2014-05-07,6.92,75591.66,19525.82,Sub_Saharan Africa || C : Sao Tome and Principe
4,Sub_Saharan Africa,Rwanda,Office Supplies,Offline,L,2013-06-02,524.96,3296425.02,639077.50,Sub_Saharan Africa || C : Rwanda

In [24]:
# Select the last row in the dataset
sales[-1:]

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit,region_country
99,Sub_Saharan Africa,Mozambique,Household,Offline,L,2012-02-15,502.54,3586605.09,889472.91,Sub_Saharan Africa || C : Mozambique

# LOC

In [25]:
# Select all columns for rows of index values 0 and 10
sales.loc[[0, 10], :]

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit,region_country
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,2010-06-27,159.42,2533654.00,951410.50,Australia and Oceania || C : Tuvalu
10,Asia,Kyrgyzstan,Vegetables,Online,H,2011-12-07,90.93,19103.44,7828.12,Asia || C : Kyrgyzstan

In [26]:
# Select first row and specific column
sales.loc[[0,1], ['Region', 'Country', 'Item_Type']]

                              Region  Country  Item_Type
0              Australia and Oceania   Tuvalu  Baby Food
1  Central America and the Caribbean  Grenada     Cereal

In [27]:
sales.loc[[0, 10, 25],:]

,Region,Country,Item_Type,Sales_Channel,Order_Priority,Ship_Date,Unit_Cost,Total_Revenue,Total_Profit,region_country
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,2010-06-27,159.42,2533654.00,951410.50,Australia and Oceania || C : Tuvalu
10,Asia,Kyrgyzstan,Vegetables,Online,H,2011-12-07,90.93,19103.44,7828.12,Asia || C : Kyrgyzstan
25,Europe,France,Cosmetics,Online,H,2017-05-06,263.33,793518.00,315574.05,Europe || C : France

In [28]:
#error solved
sales.loc[[0,10],['Country','Ship_Date']]

       Country  Ship_Date
0       Tuvalu 2010-06-27
10  Kyrgyzstan 2011-12-07

In [29]:
#error
sales.loc[[0:4],:]
# while sales.loc[0:4,:] would not give an error

SyntaxError: invalid syntax (1039194968.py, line 2)

In [ ]:
sales.loc[[0,4],:]

# ILOC

In [ ]:
# Syntax for iloc indexing to finding a specific data element
sales.iloc[row, column]

In [ ]:
#value in 2nd row and 6th column
sales.iloc[2,6]

In [ ]:
#Slicing Subsets of Rows and Columns in Python
# To select a subset of rows and columns from our DataFrame, 
# we can use the iloc method. For example, we can select month, day and year 
#(columns 2, 3 and 4 if we start counting at 1), like this:
#iloc[row slicing,column slicing]

In [ ]:
sales.iloc[2:6,6:9]

# Subsetting & Filter

# Data selection based on Condition

In [ ]:
#Subsetting Data using Criteria
sales
sales[sales.Sales_Channel == "Offline"]

In [ ]:
sales
sales[sales.Sales_Channel != "Offline"]

In [ ]:
# baby food, cereal, unit cost> 100
sales[(sales.Total_Profit >= 150000) & (sales.Total_Revenue >= 50000)].head()

In [ ]:
sales[(sales.Country=='Australia') & (sales.Item_Type=='Cereal') & (sales.Sales_Channel=='Offline')]

In [ ]:
sales[(sales.Order_Priority=='H') & (sales.Sales_Channel=='Offline')]

# Descriptive Statistics

In [ ]:
sales.mean()

In [ ]:
#self example
sales.Total_Profit.mean()

In [ ]:
#self example
sales[['Unit_Cost','Total_Profit']].mean()

In [ ]:
sales.max()

In [ ]:
#self example
sales.Total_Profit.max()

In [ ]:
#self explainatory
sales.min()

In [ ]:
#self explainatory
sales.median()

In [ ]:
# for finding standard deviation
sales.std()

In [ ]:
# for finding variance
sales.var()

The describe() method is used for calculating some statistical data like percentile, mean and std of the numerical values of the Series or DataFrame. It analyzes both numeric and object series and also the DataFrame column sets of mixed data types.

In [ ]:
sales.describe()

In [ ]:
sales.Unit_Cost.describe()

info() function is used to get a concise summary of the dataframe

In [ ]:
sales.info()

In [ ]:
#check datatype
sales.dtypes['Region']

In [ ]:
sales.dtypes['Total_Profit']

count() function return count of values in each elements

In [ ]:
# to count the number of rows
sales.count()

In [ ]:
# skew() function return unbiased skew over requested axis
sales.skew()

In [ ]:
#kurt() function return unbiased kurtosis over requested axis
sales.kurt()

In [ ]:
#Compute pairwise correlation of columns, excluding NA/null values. 
sales.corr()

In [ ]:
#Covariance is a measure of how much two random variables vary together.
#The cov() function is used to compute pairwise covariance of columns, excluding NA/null values. 
sales.cov()

# Apply function

apply takes a function and applies it to all values of pandas series or dataframe

In [ ]:
sales.apply(max)

In [ ]:
sales.apply(min)

# DROP ENTERIES/VALUES

# Drop Columns

In [ ]:
#To remove column Region
Newdata=sales.drop(['Region'], axis=1)
Newdata.head()

In [ ]:
Newdata.to_excel("Nayifile.xlsx")

In [ ]:
#To make permanent change in the dataset

sales.drop(['Item_Type'], axis=1,inplace=True)
sales.head()

In [ ]:
sales.head()

In [ ]:
# Remove more than one column
sales.drop(['Region','Total_Profit'],axis=1).head()

In [ ]:
# Remove more than one column
sales.drop(['Region','Unit_Cost','Total_Profit'],axis=1).head()

In [ ]:
# Remove Multiple Columns in Python by indenxing
sales.drop(sales.columns[[0,2]], axis =1).head()

In [ ]:
#Remove column count 3(Ship_Date)
sales.drop(sales.columns[3], axis =1).head()

# Drop Rows

In [ ]:
# Drop an observation (row)
sales.drop([1,2]).head(5)

# Drop Columns from a Dataframe using loc[] and drop() method

Drop Columns from a Dataframe using loc[] and drop() method

In [ ]:
# Remove all columns between column name 'Country' to 'Total_Profit'
sales.drop(sales.loc[:, 'Country':'Total_Profit'].columns, axis = 1).head()

# Drop Duplicates

In [ ]:
# to convert the below into tabular or Relational Form
data = {"StudentName": ["Reena", "Anil", "Mansi", "Jaman","Reena"],
        "Age": [24, 28, 26, 24,24],
        "Sex": ["Female", "Male", "Female", "Male","Female"]}
df = pd.DataFrame(data)
print(df)

# Drop Duplicate Rows
#drop_duplicates returns only the dataframeâ€™s unique values. Removing duplicate records is sample.

In [ ]:
df = df.drop_duplicates()
print(df)

In [ ]:
# will keep only last Reena
df = df.drop_duplicates(keep='last')
print(df)

In [ ]:
df = df['StudentName'].drop_duplicates()
print(df)

# Sorting Asceding and Desceding

In [ ]:
#Sort Ascending(by defalut)
new_data = df.sort_values('Age')
new_data

In [ ]:
# Sort Descending
new_data = df.sort_values('Age', ascending=False)
new_data

In [ ]:
new_data = df.sort_values('StudentName', ascending=False)
new_data

# Concatenate

In [ ]:
# Creating first dataframe 
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'], 
                    'C': ['C0', 'C1', 'C2', 'C3'], 
                    'D': ['D0', 'D1', 'D2', 'D3']}, 
#                     index = [0, 1, 2, 3]) 
                  )
df1

In [ ]:
# Creating second dataframe 
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'], 
                    'B': ['B4', 'B5', 'B6', 'B7'], 
                    'C': ['C4', 'C5', 'C6', 'C7'], 
                    'D': ['D4', 'D5', 'D6', 'D7']}, 
#                     index = [4, 5, 6, 7])
                  )
df2

In [ ]:
# Creating third dataframe 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'], 
                    'B': ['B8', 'B9', 'B10', 'B11'], 
                    'C': ['C8', 'C9', 'C10', 'C11'], 
                    'D': ['D8', 'D9', 'D10', 'D11']}, 
#                     index = [8, 9, 10, 11])
                  )
df3

In [ ]:
# Concatenating the dataframes 
pd.concat([df1, df2, df3],axis=1)

# reset index only when we are using rows i.e axis = 0

# Group By

groupby() function is used to split the data into groups based on some criteria

In [ ]:
sales.columns

In [ ]:
sales.groupby(['Sales_Channel']).mean()

In [ ]:
sales.groupby(['Sales_Channel']).mean()

In [ ]:
sales.groupby(['Order_Priority']).sum().head()

In [ ]:
sales.groupby(['Region','Sales_Channel','Order_Priority']).count()['Unit_Cost'].head()

# PIVOT Tables

In [ ]:
pd.pivot_table(sales, index = ['Sales_Channel', 'Order_Priority'], aggfunc='sum')

# Crosstab in Pandas

#crosstab() function in Python. This method is used to compute a simple cross-tabulation of two (or more) factors

In [ ]:
pd.crosstab(sales['Sales_Channel'],sales.Unit_Cost)

# Merge & Joins

In [30]:
user_usage = pd.read_csv("Usage Data.csv")
user_device = pd.read_csv("user_data.csv")

In [31]:
user_usage.head()

   outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                    21.97                    4.82     1557.33   22787
1                  1710.08                  136.88     7267.55   22788
2                  1710.08                  136.88     7267.55   22789
3                    94.46                   35.17      519.12   22790
4                    71.59                   79.26     1557.33   22792

In [32]:
user_device.head()

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

# Inner Merge-bydefault

In [36]:
result = pd.merge(user_usage,user_device,on='use_id',how='inner')
result.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,user_id,platform,platform_version,device,use_type_id
0,21.97,4.82,1557.33,22787,12921,android,4.3,GT-I9505,1
1,1710.08,136.88,7267.55,22788,28714,android,6.0,SM-G930F,1
2,1710.08,136.88,7267.55,22789,28714,android,6.0,SM-G930F,1
3,94.46,35.17,519.12,22790,29592,android,5.1,D2303,1
4,71.59,79.26,1557.33,22792,28217,android,5.1,SM-G361F,1

# Select specific columns in joined

In [ ]:
result = pd.merge(user_usage,
                 user_device[['use_id', 'platform', 'device']],
                 on='use_id')
result.head()

# Left Merge

In [ ]:
left_merge = pd.merge(user_usage,user_device,on='use_id',how='left')
left_merge.head()

# Right Merge

In [ ]:
right_merge = pd.merge(user_usage,user_device,on='use_id',how='right')
right_merge.head()

# Outer Merge

In [ ]:
outer_merge = pd.merge(user_usage,user_device,on='use_id',how='outer')
outer_merge.head()